 IDENTIFICATION DIVISION.
 PROGRAM-ID. MRUNAL.  
 ENVIRONMENT DIVISION.
 INPUT-OUTPUT SECTION.
 FILE-CONTROL.  
***************************************************************** 
*  THIS SECTION WILL SHOW THE FILE CONTROLLING.
*****************************************************************  
     COPY 'LOC01'.
     COPY 'EMP01'.
     SELECT EMP-FILE ASSIGN TO 'EMP.DAT'
     ORGANIZATION IS SEQUENTIAL
     ACCESS MODE IS SEQUENTIAL
     FILE STATUS IS WS-EMP-STAT.
     SELECT SORT-FILE ASSIGN TO 'SORT.DAT'.
     SELECT REPORT-FILE ASSIGN TO 'REPORT123.REP'
     ORGANIZATION IS SEQUENTIAL
     ACCESS MODE SEQUENTIAL
     FILE STATUS IS WS-REPORT-STAT.  
 DATA DIVISION. 
 FILE SECTION.
    COPY 'EMP02'.
    COPY 'LOC02'.
 FD EMP-FILE
     RECORD CONTAINS 80 CHARACTERS
     RECORDING MODE IS F.
 01 EMP-RECORD. 
     02 E-EMP-CODE       PIC 9(06).
     02 E-EMP-NAME       PIC X(15).
     02 E-EMP-GROUP      PIC X(10).
     02 E-EMP-DESG       PIC X(15).
     02 E-EMP-LOC        PIC X(03).
     02 FILLER           PIC X(31).
*******************************************************************     
*    SORTING DIVISION
*******************************************************************    
 SD SORT-FILE     
     RECORD CONTAINS 80 CHARACTERS
     RECORDING MODE IS F.
 01 SORT-RECORD. 
     02 FILLER           PIC X(21).
     02 S-EMP-GROUP      PIC X(10).
     02 FILLER           PIC X(49).
 FD REPORT-FILE
     RECORD CONTAINS 80 CHARACTERS
     RECORDING MODE IS F.
 01 OUT-RECORD           PIC X(80).
 WORKING-STORAGE SECTION.
 01 HEADING-LINE1.
     02 FILLER           PIC X(10)   VALUE SPACES.
     02 FILLER           PIC X(27)   
                 VALUE 'Capgemini Global Solutions '.
     02 FILLER           PIC X(23).
 01 HEADING-LINE2.
     02 FILLER           PIC X(05)   VALUE SPACES.
     02 FILLER           PIC X(43)   
            VALUE 'Group wise list of employees working at TTC'.
     02 FILLER           PIC X(13).
 01 HEADING-LINE3.
     02 FILLER           PIC X(07)   VALUE 'GROUP :'.
     02 H3-GROUP         PIC X(10).
     02 FILLER           PIC X(43)   VALUE SPACES.
 01 HEADING-LINE4.   
     02 FILLER           PIC X(01)   VALUE '-' OCCURS 60 TIMES.
 01 HEADING-LINE5. 
     02 FILLER           PIC X(10)   VALUE 'Emp code'.
     02 FILLER           PIC X(02)   VALUE SPACES. 
     02 FILLER           PIC X(15)   VALUE 'Name'.
     02 FILLER           PIC X(02)   VALUE SPACES.
     02 FILLER           PIC X(10)   VALUE 'MANAGER'.
 01 LAST-LINE.
     02 FILLER           PIC X(01)   VALUE '-' OCCURS 60 TIMES.
 01 DETAIL-LINE.
     02 D-EMP-CODE       PIC X(06).
     02 FILLER           PIC X(06)   VALUE SPACES.
     02 D-EMP-NAME       PIC X(15).
     02 FILLER           PIC X(02)   VALUE SPACES.
     02 D-EMP-DESG       PIC X(15).
 01 USER-CITY            PIC X(15)   VALUE SPACES.
 01 TEMP-GROUP           PIC X(10)   VALUE SPACES.
 01 WS-EMP-STAT          PIC X(02).   
     88 OPEN-EMP-SUCCESS             VALUE 00.
 01 WS-EMP-FLAG          PIC X(02)   VALUE 'N'.
     88 END-EMP-FILE                 VALUE 'Y'.
 01 WS-REPORT-STAT          PIC X(02).   
     88 OPEN-REPORT-SUCCESS             VALUE 00.
 PROCEDURE DIVISION.
 MAIN-PARA.  
     PERFORM SORT-PARA
     PERFORM INIT-PARA
     PERFORM READ-PARA
     MOVE EMP-GROUP TO H3-GROUP , TEMP-GROUP
     PERFORM HEADING-PARA
     PERFORM PROCESS-PARA UNTIL END-EMP-FILE
     PERFORM END-PARA.
 SORT-PARA.
     SORT SORT-FILE
         ON ASCENDING KEY S-EMP-GROUP
         USING EMPLOYEE-FILE
         GIVING EMP-FILE.
 INIT-PARA.
     OPEN INPUT EMP-FILE
     OPEN INPUT LOCATION-FILE
     OPEN OUTPUT REPORT-FILE
     IF OPEN-EMP-SUCCESS
         DISPLAY 'EMPLOYEE FILE OPENED' , WS-EMP-STAT
     END-IF. 
     IF OPEN-REPORT-SUCCESS
         DISPLAY ' REPORT FILE OPENED' , WS-REPORT-STAT
     END-IF.
     DISPLAY ' ENTER THE CITY NAME :'
     ACCEPT USER-CITY.
 READ-PARA. 
     READ EMP-FILE
         AT END
             MOVE 'Y' TO WS-EMP-FLAG
     END-READ.
 HEADING-PARA.    
     WRITE OUT-RECORD FROM HEADING-LINE1 AFTER ADVANCING PAGE
     WRITE OUT-RECORD FROM HEADING-LINE2.
     WRITE OUT-RECORD FROM HEADING-LINE3.
     WRITE OUT-RECORD FROM HEADING-LINE4.
     WRITE OUT-RECORD FROM HEADING-LINE5.    
 PROCESS-PARA.
     MOVE USER-CITY TO LOC-CITY
     READ LOCATION-FILE 
         KEY IS LOC-CITY
         INVALID KEY
             DISPLAY 'INVALID CITY NAME'
         NOT INVALID KEY
              IF LOC-CODE = EMP-LOC
                 PERFORM MOVE-PARA
              END-IF
     END-READ. 
    
 MOVE-PARA.
     IF EMP-GROUP = TEMP-GROUP
         MOVE EMP-CODE TO D-EMP-CODE 
         MOVE EMP-NAME TO D-EMP-NAME
         EVALUATE EMP-DESG
             WHEN 'MANAGER'
                 MOVE '*' TO D-EMP-DESG
             WHEN OTHER
                 MOVE SPACES TO D-EMP-DESG
         END-EVALUATE 
     ELSE
         PERFORM GROUP-CHANGE-PARA
     END-IF. 
     WRITE OUT-RECORD FROM DETAIL-LINE.
     PERFORM READ-PARA.
 GROUP-CHANGE-PARA.        
     MOVE EMP-GROUP TO H3-GROUP , TEMP-GROUP 
     WRITE OUT-RECORD FROM LAST-LINE 
     WRITE OUT-RECORD FROM HEADING-LINE1 AFTER ADVANCING PAGE
     WRITE OUT-RECORD FROM HEADING-LINE2.
     WRITE OUT-RECORD FROM HEADING-LINE3.
     WRITE OUT-RECORD FROM HEADING-LINE4.
     WRITE OUT-RECORD FROM HEADING-LINE5.  
 END-PARA.
     WRITE OUT-RECORD FROM LAST-LINE
     CLOSE EMP-FILE
     CLOSE LOCATION-FILE
     CLOSE REPORT-FILE.
     
